backend/app/controllers/cities_controller.rb

  def index
    @cities = City.includes(:country).all
---
SELECT "cities".* FROM "cities"
SELECT "countries".* FROM "countries" WHERE "countries"."id" IN ($1, $2, $3, $4, $5)  [["id", 1], ["id", 2], ["id", 3], ["id", 5], ["id", 6]]

  def show
    @city = City.includes(:country).find(params[:id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]