backend/app/controllers/countries_controller.rb

SELECT "countries".* FROM "countries"
---
  def index
    @countries = Country.all

SELECT "countries".* FROM "countries" WHERE "countries"."id" IN ($1, $2, $3, $4)  [["id", 2], ["id", 3], ["id", 5], ["id", 6]]
---
  def show
    @country = Country.find(params[:id])