backend/app/controllers/flows_controller.rb

UPDATE "flows" SET "name" = $1, "updated_at" = $2 WHERE "flows"."id" = $3  [["name", "UpdatedFlow"], ["updated_at", "2025-08-17 01:50:07.050164"], ["id", "853a1440-30bb-415b-9212-9823f474a7ee"]]
---
  def update
    if @flow.update(flow_params)

SELECT "flows".* FROM "flows" WHERE "flows"."name" = $1 LIMIT $2  [["name", "UniqueFlow"], ["LIMIT", 1]]
---
  def by_name
    @flow = Flow.find_by(name: params[:name])