backend/app/controllers/flows_controller.rb

SELECT "flows".* FROM "flows"
---
  def index
    @flows = Flow.all

INSERT INTO "flows" ("id", "name", "json_schema", "city_id", "country_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @flow = Flow.new(flow_params)

    if @flow.save

UPDATE "flows" SET "city_id" = $1, "country_id" = $2, "updated_at" = $3 WHERE "flows"."id" = $4  [["city_id", 12], ["country_id", 3], ["updated_at", "2025-08-17 06:36:55.514279"], ["id", "d01dac97-a276-4b2b-a640-dcf939c9bedd"]]
---
  def update
    if @flow.update(flow_params)

DELETE FROM "flows" WHERE "flows"."id" = $1  [["id", "d439e4e3-ee50-4d0d-8865-31775389b898"]]
---
  def destroy
    @flow.destroy

SELECT "flows".* FROM "flows" WHERE "flows"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_flow
    @flow = Flow.find(params[:id])