backend/app/serializers/flow_serializer.rb

  def city
    return nil unless object.city

    {
      id: object.city.id,
      name: object.city.name,
      country: {
        id: object.city.country.id,
        name: object.city.country.name
---
SELECT "cities".* FROM "cities"
SELECT "countries".* FROM "countries"